In [2]:
import sqlite3
import pandas as pd

In [3]:
con = sqlite3.connect(':memory:')

In [4]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [5]:
for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [6]:
pd.read_sql(
    '''
    SELECT * FROM Categories
    ''',
    con,
)

,CategoryID,CategoryName,Description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"
5,6,Meat/Poultry,Prepared meats
6,7,Produce,Dried fruit and bean curd
7,8,Seafood,Seaweed and fish

In [7]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

In [8]:
tasks+=1
pd.read_sql(
    '''
    SELECT CustomerName, Country, Address 
    FROM 
        Customers
    WHERE Country IN ('Germany', 'France', 'Spain')
    ''',
    con,
)

,CustomerName,Country,Address
0,Alfreds Futterkiste,Germany,Obere Str. 57
1,Blauer See Delikatessen,Germany,Forsterstr. 57
2,Blondel p√®re et fils,France,"24, place Kl√©ber"
3,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
4,Bon app',France,"12, rue des Bouchers"
5,Drachenblut Delikatessend,Germany,Walserweg 21
6,Du monde entier,France,"67, rue des Cinquante Otages"
7,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
8,Folies gourmandes,France,"184, chauss√©e de Tournai"
9,Frankenversand,Germany,Berliner Platz 43
10,France restauration,France,"54, rue Royale"
11,Galer√≠a del gastr√≥nomo,Spain,"Rambla de Catalu√±a, 23"
12,Godos Cocina T√≠pica,Spain,"C/ Romero, 33"
13,K√∂niglich Essen,Germany,Maubelstr. 90
14,La corne d'abondance,France,"67, avenue de l'Europe"
15,La maison d'Asie,France,1 rue Alsace-Lorraine
16,Lehmanns Marktstand,Germany,Magazinweg 7
17,Morgenstern Gesundkost,Germany,Heerstr. 22
18,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
19,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
20,QUICK-Stop,Germany,Taucherstra√üe 10
21,Romero y tomillo,Spain,"Gran V√≠a, 1"
22,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
23,Toms Spezialit√§ten,Germany,Luisenstr. 48
24,Victuailles en stock,France,"2, rue du Commerce"
25,Vins et alcools Chevalier,France,59 rue de l'Abbaye
26,Die Wandernde Kuh,Germany,Adenauerallee 900

2. –í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

In [9]:
tasks+=1
pd.read_sql(
    '''
    SELECT Country, count(*) as cnt 
    FROM 
        Customers
    GROUP BY Country
    ORDER BY count(*) desc
    LIMIT 3
    ''',
    con,
)

   Country  cnt
0      USA   13
1  Germany   11
2   France   11

3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

In [10]:
tasks+=1
pd.read_sql(
    '''
    SELECT ShipperName, OrderDate 
    FROM (
        SELECT *
        , row_number() over (
        order by substr(OrderDate, 7) || "-" || substr(OrderDate,4,2)  || "-" || substr(OrderDate, 1,2) asc
        ) as rn 
        FROM 
            Orders o
        INNER JOIN 
            Shippers s 
        ON 
            o.ShipperID=s.ShipperID)
    WHERE rn = 10
    ''',
    con,
)

        ShipperName   OrderDate
0  Federal Shipping  16.07.1996

4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

In [11]:
tasks+=1
pd.read_sql(
    '''
    SELECT p.ProductID, p.ProductName, p.Price
    FROM OrderDetails od
    INNER JOIN 
        Products p
    ON
        p.ProductID=od.ProductID
    WHERE OrderID = (
        SELECT OrderID
        FROM Products p
        INNER JOIN OrderDetails o ON p.ProductID=o.ProductID
        GROUP BY OrderID
        ORDER BY sum(Price*Quantity) desc
        LIMIT 1)
    ''',
    con,
)

   ProductID             ProductName  Price
0         20  Sir Rodney's Marmalade     81
1         38           C√¥te de Blaye  263.5
2         60       Camembert Pierrot     34
3         72  Mozzarella di Giovanni   34.8

5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT p.ProductName, o.Quantity, o.OrderID
    FROM 
        Products p
    INNER JOIN 
        OrderDetails o 
    ON 
        p.ProductID=o.ProductID
    INNER JOIN
        (SELECT ProductID
        FROM 
            OrderDetails
        GROUP BY ProductID
        ORDER BY sum(Quantity) desc
        LIMIT 1) f
    ON
        p.ProductID=f.ProductID
    ''',
    con,
)

          ProductName  Quantity  OrderID
0   Gorgonzola Telino        20    10253
1   Gorgonzola Telino        40    10272
2   Gorgonzola Telino        15    10273
3   Gorgonzola Telino         4    10325
4   Gorgonzola Telino        25    10335
5   Gorgonzola Telino        56    10342
6   Gorgonzola Telino        30    10356
7   Gorgonzola Telino        70    10359
8   Gorgonzola Telino        20    10363
9   Gorgonzola Telino        30    10374
10  Gorgonzola Telino        42    10376
11  Gorgonzola Telino        60    10390
12  Gorgonzola Telino        32    10393
13  Gorgonzola Telino        14    10423

6. –í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [14]:
tasks+=1
pd.read_sql(
    '''
    SELECT s.SupplierName, s.Country, s.ContactName, s.Phone
    FROM 
        OrderDetails o
    INNER JOIN
        Products p
    ON
        o.ProductID=p.ProductID
    LEFT JOIN
        Suppliers s
    ON
        p.SupplierID=s.SupplierID
    GROUP BY p.SupplierID
    ORDER BY count(distinct OrderID) desc
    LIMIT 5
    ''',
    con,
)

                        SupplierName    Country   ContactName           Phone
0  Plutzer Lebensmittelgro√üm√§rkte AG    Germany   Martin Bein    (069) 992755
1                      Pavlova, Ltd.  Australia   Ian Devling   (03) 444-2343
2           Specialty Biscuits, Ltd.         UK  Peter Wilson  (161) 555-4448
3                    Norske Meierier     Norway  Beate Vileid     (0)2-953010
4            Formaggi Fortini s.r.l.      Italy    Elio Rossi    (0544) 60323

7. –ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

In [15]:
tasks+=1
pd.read_sql(
    '''
    SELECT cu.Country, c.CategoryName, sum(Quantity*Price) as sum
    FROM 
        OrderDetails od
    INNER JOIN
        Products p
    ON
        od.ProductID=p.ProductID
    INNER JOIN
        Categories c
    ON
        p.CategoryID=c.CategoryID
    INNER JOIN
        Orders o
    ON
        od.OrderID=o.OrderID
    INNER JOIN
        Customers cu
    ON
        o.CustomerID=cu.CustomerID and cu.Country='Brazil'
    GROUP BY c.CategoryID
    ORDER BY sum(Quantity*Price) desc
    LIMIT 1
    ''',
    con,
)

  Country CategoryName      sum
0  Brazil    Beverages  13636.0

8. –ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

In [16]:
tasks+=1
pd.read_sql(
    '''
    SELECT max(sum) - min(sum) as diff 
        FROM(
        SELECT cu.Country
        , od.OrderID
        , sum(Quantity*Price) as sum
        FROM 
            OrderDetails od
        INNER JOIN
            Products p
        ON
            od.ProductID=p.ProductID
        INNER JOIN
            Categories c
        ON
            p.CategoryID=c.CategoryID
        INNER JOIN
            Orders o
        ON
            od.OrderID=o.OrderID
        INNER JOIN
            Customers cu
        ON
            o.CustomerID=cu.CustomerID and cu.Country='USA'
        GROUP BY od.OrderID)
    ''',
    con,
)

      diff
0  7698.45

In [17]:
pd.read_sql(
    '''
        SELECT *
        FROM 
            OrderDetails od
                INNER JOIN
            Products p
        ON
            od.ProductID=p.ProductID
        WHERE OrderID=10349
    ''',
    con,
)

,OrderDetailID,OrderID,ProductID,Quantity,ProductID,ProductName,SupplierID,CategoryID,Unit,Price
0,272,10349,54,24,54,Tourti√®re,25,6,16 pies,–∏—é–ª—å.45

9. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

In [18]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
    count(distinct OrderID) as cnt_orders,
    FirstName ||' '|| LastName as Emp,
    DATE('now') -
    substr(BirthDate, 7) || "-" || substr(BirthDate,4,2)  || "-" || substr(BirthDate, 1,2) as Age,
    substr(BirthDate, 7) || "-" || substr(BirthDate,4,2)  || "-" || substr(BirthDate, 1,2) as NewBirth
    FROM Employees e
    INNER JOIN
        Orders o
    ON
        e.EmployeeID=o.EmployeeID
    GROUP BY e.EmployeeID
    ORDER BY substr(BirthDate, 7) || "-" || substr(BirthDate,4,2)  || "-" || substr(BirthDate, 1,2) desc
    LIMIT 3
    ''',
    con,
)

   cnt_orders              Emp  Age    NewBirth
0           6   Anne Dodsworth   54  1969-07-02
1          29    Nancy Davolio   55  1968-12-08
2          31  Janet Leverling   60  1963-08-30

10. –°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

In [19]:
tasks+=1
pd.read_sql(
    '''
    SELECT sum(Quantity) as crab_meat
    FROM 
        Products p
    INNER JOIN
        OrderDetails od
    ON
        p.ProductID=od.ProductID
    WHERE lower(p.ProductName) like '%crab%'
    ''',
    con,
)

   crab_meat
0        256

In [20]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ